In [1]:
import pandas as pd

Para definir uma string não importa qual você utiliza, ' ou " vão funcionar, depende apenas de sua preferência. São apenas duas possibilidades diferentes para conseguir o mesmo resultado.

In [3]:
#criando uma list sem usar list command
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [4]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
# ver so coluna 1
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
type(df['c1'])
#isso é uma Series

pandas.core.series.Series

In [8]:
#ver mais de uma coluna
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [9]:
# isso é um data frame
type(df[['c3','c1']])

pandas.core.frame.DataFrame

In [11]:
#selecionar todas as linhas
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [13]:
#seleciona todas menos a primeira linha
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [14]:
#selecionando so algumas linhas
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [15]:
df[1:2]

    c1  c2  c3  c4
l2   5   6   7   8

In [17]:
# alternativamente, a partir da linha 1 quero so a coluna 3 e 4
df[1:][['c3','c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

Usando Lock

In [19]:
#ele vai trazer a linha 3 como uma series
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [21]:
#passar multiplas linhas
df.loc[['l3','l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [22]:
#passar a linha 1 e a coluna 2
df.loc['l1','c2']

2

In [24]:
#veja que a linha 1 coluna 2 = 2
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

Usando Ilock

In [25]:
# ele usa os indices numericos, linha 0 e coluna 1 (lembra q 1° coluna é 0)
df.iloc[0,1]

2

In [26]:
df.iloc[0,0]

1

In [28]:
#criando uma sub-,matriz
df.loc[['l3', 'l1'], ['c4','c1']]

    c4  c1
l3  12   8
l1   4   1

In [29]:
#ou
df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   8
l1   4   1

Exercicios

Crie um DataFrame somente com os alunos reprovados e mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade, nesta ordem.

In [30]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [44]:
# selecione so os aprovados
selecao = alunos['Aprovado'] == False
reprovados = alunos.loc[selecao, ['Nome', 'Sexo', 'Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

Por que no código 1 é necessário colocar selecao na parte alunos.loc[selecao, ['Nome', 'Sexo', 'Idade']] ??

a variável selecao vai funcionar como um filtro para selecionarmos apenas os alunos reprovados,

In [45]:
# ou
selecao = alunos['Aprovado'] == False
reprovados = alunos[['Nome', 'Sexo', 'Idade']][selecao]
# Você deve usar colchetes duplos se você selecionar duas ou mais colunas.
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

Podemos dar outro exemplo de filtragem

In [38]:
df = pd.DataFrame({
 'Nome': ['José', 'Maria', 'Pedro', 'Antônio'],
 'Idade': [29, 24, 20, 30],
})
df

      Nome  Idade
0     José     29
1    Maria     24
2    Pedro     20
3  Antônio     30

In [40]:
selecao = pd.Series([True, False, False, True])
selecao

0     True
1    False
2    False
3     True
dtype: bool

In [43]:
# aplicar filtro
df_filtrado = df[selecao]
df_filtrado

      Nome  Idade
0     José     29
3  Antônio     30

Crie uma visualização com os três alunos mais novos.

In [46]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [49]:
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True